[
  {
    "Name": "My first Blog!",
    "Slug": "achievement",
    "Date": "February 1, 2026",
    "Category": "Web Dev",
    "Published": true,
    "Content": "Well guys... Welcome to my new blog, this is going to be the start of something new!\n\n #What will I talk about\n\nI will talk about anything I feel like, mostly related to technology!\n\n Ok, today I will talk about how a RAG model works, it stands for retrival augmented generation. \n It is when you sen a prompt to a AI model such as chatgpt or gemini. When you send this prompt the model will get some context about what you are asking. An example of this being implemented is when you ask an chatbot something that is related to some HR policies. It will get context of all of the policies and give you an answer. "
  },
  {
    "Name": "School Classes",
    "Slug": "School",
    "Date": "February 2, 2026",
    "Category": "School",
    "Published": true,
    "Content": "Welcome to my second blog post! \n\n I am going to be talking about one of my classes, AP Computer Science Princicples. I personally find this the easiest AP class out there, if you have some commen sense then you will be able to understand the content as its pretty simple. It is also mostly about block coding which is really simple. Overall this class is fun, because I get to do cs while being with my friends. I would highly recommended people who are interested in computer science."
  },
  {
    "Name": "Apple",
    "Slug": "Tech Companies",
    "Date": "February 3, 2026",
    "Category": "School",
    "Published": true,
    "Content": "If you have an iphone, while holding it have you ever wondered why you are not getting new custom AI that many other companies are making into your phone. Why do iphone users have to get Chatgpt integration and Gemini integration, and not their own custom model. This is because Apple is building something big. The main reason Apple is not able to deploy an AI model quickly is because of how their privacy statement says that they have to make all of their data completely on device. This means that Apple has to start from scratch to build a model, then they have to make the model be completely ofline, and overall make sure the model is good and works. This is why Apple hasn't developed a model yet. Thank You for reading. "
  },
  {
    "Name": "Blog Formatting Guide (Tutorial)",
    "Slug": "tutorial",
    "Date": "February 6, 2026",
    "Category": "Tutorial",
    "Published": false,
    "Content": "**Bold Text:** Use double asterisks around text: `**Bold Text**`\n\n*Italic Text:* Use single asterisks: `*Italic Text*`\n\n# Headings\nUse `#` for H1, `##` for H2, etc.\n\n## Lists\n- Unordered list: start each line with `-`\n- Ordered list: start each line with `1.`\n\n## Links\nUse `[Text](https://example.com)` to create a link.\n\n## Code\nInline code: `` `console.log('Hi');` ``\nCode block:\n```\nfunction hello() {\n  console.log('Hello World');\n}\n```\n\n## Preview\nThis post is **unpublished**, so it will only be visible when you set `Published` to `true`."
  }
]
